FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_afec.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2014, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAM_AFEC_COMPONENT_
#define _SAM_AFEC_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Analog-Front-End Controller */
/* ============================================================================= */
/** \addtogroup SAM_AFEC Analog-Front-End Controller */
/*@{*/

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
/** \brief Afec hardware registers */
    typedef struct
    {
        __O uint32_t AFEC_CR;       /**< \brief (Afec Offset: 0x00) AFEC Control Register */
        __IO uint32_t AFEC_MR;      /**< \brief (Afec Offset: 0x04) AFEC Mode Register */
        __IO uint32_t AFEC_EMR;     /**< \brief (Afec Offset: 0x08) AFEC Extended Mode Register */
        __IO uint32_t AFEC_SEQ1R;   /**< \brief (Afec Offset: 0x0C) AFEC Channel Sequence 1 Register */
        __IO uint32_t AFEC_SEQ2R;   /**< \brief (Afec Offset: 0x10) AFEC Channel Sequence 2 Register */
        __O uint32_t AFEC_CHER;     /**< \brief (Afec Offset: 0x14) AFEC Channel Enable Register */
        __O uint32_t AFEC_CHDR;     /**< \brief (Afec Offset: 0x18) AFEC Channel Disable Register */
        __I uint32_t AFEC_CHSR;     /**< \brief (Afec Offset: 0x1C) AFEC Channel Status Register */
        __I uint32_t AFEC_LCDR;     /**< \brief (Afec Offset: 0x20) AFEC Last Converted Data Register */
        __O uint32_t AFEC_IER;      /**< \brief (Afec Offset: 0x24) AFEC Interrupt Enable Register */
        __O uint32_t AFEC_IDR;      /**< \brief (Afec Offset: 0x28) AFEC Interrupt Disable Register */
        __I uint32_t AFEC_IMR;      /**< \brief (Afec Offset: 0x2C) AFEC Interrupt Mask Register */
        __I uint32_t AFEC_ISR;      /**< \brief (Afec Offset: 0x30) AFEC Interrupt Status Register */
        __I uint32_t Reserved1[ 6 ];
        __I uint32_t AFEC_OVER;     /**< \brief (Afec Offset: 0x4C) AFEC Overrun Status Register */
        __IO uint32_t AFEC_CWR;     /**< \brief (Afec Offset: 0x50) AFEC Compare Window Register */
        __IO uint32_t AFEC_CG1R;    /**< \brief (Afec Offset: 0x54) AFEC Channel Gain 1 Register */
        __IO uint32_t AFEC_CG2R;    /**< \brief (Afec Offset: 0x58) AFEC Channel Gain 2 Register */
        __I uint32_t Reserved2[ 1 ];
        __IO uint32_t AFEC_DIFFR;   /**< \brief (Afec Offset: 0x60) AFEC Channel Differential Register */
        __IO uint32_t AFEC_CSELR;   /**< \brief (Afec Offset: 0x64) AFEC Channel Register Selection */
        __I uint32_t AFEC_CDR;      /**< \brief (Afec Offset: 0x68) AFEC Channel Data Register */
        __IO uint32_t AFEC_COCR;    /**< \brief (Afec Offset: 0x6C) AFEC Channel Offset Compensation Register */
        __IO uint32_t AFEC_TEMPMR;  /**< \brief (Afec Offset: 0x70) AFEC Temperature Sensor Mode Register */
        __IO uint32_t AFEC_TEMPCWR; /**< \brief (Afec Offset: 0x74) AFEC Temperature Compare Window Register */
        __I uint32_t Reserved3[ 7 ];
        __IO uint32_t AFEC_ACR;     /**< \brief (Afec Offset: 0x94) AFEC Analog Control Register */
        __I uint32_t Reserved4[ 2 ];
        __IO uint32_t AFEC_SHMR;    /**< \brief (Afec Offset: 0xA0) AFEC Sample & Hold Mode Register */
        __I uint32_t Reserved5[ 11 ];
        __IO uint32_t AFEC_COSR;    /**< \brief (Afec Offset: 0xD0) AFEC Correction Select Register */
        __IO uint32_t AFEC_CVR;     /**< \brief (Afec Offset: 0xD4) AFEC Correction Values Register */
        __IO uint32_t AFEC_CECR;    /**< \brief (Afec Offset: 0xD8) AFEC Channel Error Correction Register */
        __I uint32_t Reserved6[ 2 ];
        __IO uint32_t AFEC_WPMR;    /**< \brief (Afec Offset: 0xE4) AFEC Write Protection Mode Register */
        __I uint32_t AFEC_WPSR;     /**< \brief (Afec Offset: 0xE8) AFEC Write Protection Status Register */
        __I uint32_t Reserved7[ 4 ];
        __I uint32_t AFEC_VERSION;  /**< \brief (Afec Offset: 0xFC) AFEC Version Register */
    } Afec;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */
/* -------- AFEC_CR : (AFEC Offset: 0x00) AFEC Control Register -------- */
#define AFEC_CR_SWRST                          ( 0x1u << 0 )                    /**< \brief (AFEC_CR) Software Reset */
#define AFEC_CR_START                          ( 0x1u << 1 )                    /**< \brief (AFEC_CR) Start Conversion */
/* -------- AFEC_MR : (AFEC Offset: 0x04) AFEC Mode Register -------- */
#define AFEC_MR_TRGEN                          ( 0x1u << 0 )                    /**< \brief (AFEC_MR) Trigger Enable */
#define   AFEC_MR_TRGEN_DIS                    ( 0x0u << 0 )                    /**< \brief (AFEC_MR) Hardware triggers are disabled. Starting a conversion is only possible by software. */
#define   AFEC_MR_TRGEN_EN                     ( 0x1u << 0 )                    /**< \brief (AFEC_MR) Hardware trigger selected by TRGSEL field is enabled. */
#define AFEC_MR_TRGSEL_Pos                     1
#define AFEC_MR_TRGSEL_Msk                     ( 0x7u << AFEC_MR_TRGSEL_Pos )   /**< \brief (AFEC_MR) Trigger Selection */
#define   AFEC_MR_TRGSEL_AFEC_TRIG0            ( 0x0u << 1 )                    /**< \brief (AFEC_MR) ADC_TRIG0 */
#define   AFEC_MR_TRGSEL_AFEC_TRIG1            ( 0x1u << 1 )                    /**< \brief (AFEC_MR) ADC_TRIG1 */
#define   AFEC_MR_TRGSEL_AFEC_TRIG2            ( 0x2u << 1 )                    /**< \brief (AFEC_MR) ADC_TRIG2 */
#define   AFEC_MR_TRGSEL_AFEC_TRIG3            ( 0x3u << 1 )                    /**< \brief (AFEC_MR) ADC_TRIG3 */
#define   AFEC_MR_TRGSEL_AFEC_TRIG4            ( 0x4u << 1 )                    /**< \brief (AFEC_MR) ADC_TRIG4 */
#define   AFEC_MR_TRGSEL_AFEC_TRIG5            ( 0x5u << 1 )                    /**< \brief (AFEC_MR) ADC_TRIG5 */
#define   AFEC_MR_TRGSEL_AFEC_TRIG6            ( 0x6u << 1 )                    /**< \brief (AFEC_MR) ADC_TRIG6 */
#define AFEC_MR_SLEEP                          ( 0x1u << 5 )                    /**< \brief (AFEC_MR) Sleep Mode */
#define   AFEC_MR_SLEEP_NORMAL                 ( 0x0u << 5 )                    /**< \brief (AFEC_MR) Normal Mode: The AFEC Core and reference voltage circuitry are kept ON between conversions */
#define   AFEC_MR_SLEEP_SLEEP                  ( 0x1u << 5 )                    /**< \brief (AFEC_MR) Sleep Mode: The AFEC Core and reference voltage circuitry are OFF between conversions */
#define AFEC_MR_FWUP                           ( 0x1u << 6 )                    /**< \brief (AFEC_MR) Fast Wake-up */
#define   AFEC_MR_FWUP_OFF                     ( 0x0u << 6 )                    /**< \brief (AFEC_MR) Normal Sleep Mode: The sleep mode is defined by the SLEEP bit */
#define   AFEC_MR_FWUP_ON                      ( 0x1u << 6 )                    /**< \brief (AFEC_MR) Fast Wake Up Sleep Mode: The Voltage reference is ON between conversions and AFEC Core is OFF */
#define AFEC_MR_FREERUN                        ( 0x1u << 7 )                    /**< \brief (AFEC_MR) Free Run Mode */
#define   AFEC_MR_FREERUN_OFF                  ( 0x0u << 7 )                    /**< \brief (AFEC_MR) Normal Mode */
#define   AFEC_MR_FREERUN_ON                   ( 0x1u << 7 )                    /**< \brief (AFEC_MR) Free Run Mode: Never wait for any trigger. */
#define AFEC_MR_PRESCAL_Pos                    8
#define AFEC_MR_PRESCAL_Msk                    ( 0xffu << AFEC_MR_PRESCAL_Pos ) /**< \brief (AFEC_MR) Prescaler Rate Selection */
#define AFEC_MR_PRESCAL( value )    ( ( AFEC_MR_PRESCAL_Msk & ( ( value ) << AFEC_MR_PRESCAL_Pos ) ) )
#define AFEC_MR_STARTUP_Pos                    16
#define AFEC_MR_STARTUP_Msk                    ( 0xfu << AFEC_MR_STARTUP_Pos )  /**< \brief (AFEC_MR) Start-up Time */
#define   AFEC_MR_STARTUP_SUT0                 ( 0x0u << 16 )                   /**< \brief (AFEC_MR) 0 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT8                 ( 0x1u << 16 )                   /**< \brief (AFEC_MR) 8 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT16                ( 0x2u << 16 )                   /**< \brief (AFEC_MR) 16 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT24                ( 0x3u << 16 )                   /**< \brief (AFEC_MR) 24 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT64                ( 0x4u << 16 )                   /**< \brief (AFEC_MR) 64 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT80                ( 0x5u << 16 )                   /**< \brief (AFEC_MR) 80 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT96                ( 0x6u << 16 )                   /**< \brief (AFEC_MR) 96 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT112               ( 0x7u << 16 )                   /**< \brief (AFEC_MR) 112 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT512               ( 0x8u << 16 )                   /**< \brief (AFEC_MR) 512 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT576               ( 0x9u << 16 )                   /**< \brief (AFEC_MR) 576 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT640               ( 0xAu << 16 )                   /**< \brief (AFEC_MR) 640 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT704               ( 0xBu << 16 )                   /**< \brief (AFEC_MR) 704 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT768               ( 0xCu << 16 )                   /**< \brief (AFEC_MR) 768 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT832               ( 0xDu << 16 )                   /**< \brief (AFEC_MR) 832 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT896               ( 0xEu << 16 )                   /**< \brief (AFEC_MR) 896 periods of AFEClock */
#define   AFEC_MR_STARTUP_SUT960               ( 0xFu << 16 )                   /**< \brief (AFEC_MR) 960 periods of AFEClock */
#define AFEC_MR_ANACH                          ( 0x1u << 23 )                   /**< \brief (AFEC_MR) Analog Change */
#define   AFEC_MR_ANACH_NONE                   ( 0x0u << 23 )                   /**< \brief (AFEC_MR) No analog change on channel switching: DIFF0, GAIN0 are used for all channels */
#define   AFEC_MR_ANACH_ALLOWED                ( 0x1u << 23 )                   /**< \brief (AFEC_MR) Allows different analog settings for each channel. See AFEC_CGR. */
#define AFEC_MR_TRACKTIM_Pos                   24
#define AFEC_MR_TRACKTIM_Msk                   ( 0xfu << AFEC_MR_TRACKTIM_Pos ) /**< \brief (AFEC_MR) Tracking Time */
#define AFEC_MR_TRACKTIM( value )    ( ( AFEC_MR_TRACKTIM_Msk & ( ( value ) << AFEC_MR_TRACKTIM_Pos ) ) )
#define AFEC_MR_TRANSFER_Pos                   28
#define AFEC_MR_TRANSFER_Msk                   ( 0x3u << AFEC_MR_TRANSFER_Pos ) /**< \brief (AFEC_MR) Transfer Period */
#define AFEC_MR_TRANSFER( value )    ( ( AFEC_MR_TRANSFER_Msk & ( ( value ) << AFEC_MR_TRANSFER_Pos ) ) )
#define AFEC_MR_USEQ                           ( 0x1u << 31 )                   /**< \brief (AFEC_MR) Use Sequence Enable */
#define   AFEC_MR_USEQ_NUM_ORDER               ( 0x0u << 31 )                   /**< \brief (AFEC_MR) Normal Mode: The controller converts channels in a simple numeric order. */
#define   AFEC_MR_USEQ_REG_ORDER               ( 0x1u << 31 )                   /**< \brief (AFEC_MR) User Sequence Mode: The sequence respects what is defined in AFEC_SEQR1 and AFEC_SEQR2. */
/* -------- AFEC_EMR : (AFEC Offset: 0x08) AFEC Extended Mode Register -------- */
#define AFEC_EMR_CMPMODE_Pos                   0
#define AFEC_EMR_CMPMODE_Msk                   ( 0x3u << AFEC_EMR_CMPMODE_Pos )   /**< \brief (AFEC_EMR) Comparison Mode */
#define   AFEC_EMR_CMPMODE_LOW                 ( 0x0u << 0 )                      /**< \brief (AFEC_EMR) Generates an event when the converted data is lower than the low threshold of the window. */
#define   AFEC_EMR_CMPMODE_HIGH                ( 0x1u << 0 )                      /**< \brief (AFEC_EMR) Generates an event when the converted data is higher than the high threshold of the window. */
#define   AFEC_EMR_CMPMODE_IN                  ( 0x2u << 0 )                      /**< \brief (AFEC_EMR) Generates an event when the converted data is in the comparison window. */
#define   AFEC_EMR_CMPMODE_OUT                 ( 0x3u << 0 )                      /**< \brief (AFEC_EMR) Generates an event when the converted data is out of the comparison window. */
#define AFEC_EMR_CMPSEL_Pos                    3
#define AFEC_EMR_CMPSEL_Msk                    ( 0x1fu << AFEC_EMR_CMPSEL_Pos )   /**< \brief (AFEC_EMR) Comparison Selected Channel */
#define AFEC_EMR_CMPSEL( value )    ( ( AFEC_EMR_CMPSEL_Msk & ( ( value ) << AFEC_EMR_CMPSEL_Pos ) ) )
#define AFEC_EMR_CMPALL                        ( 0x1u << 9 )                      /**< \brief (AFEC_EMR) Compare All Channels */
#define AFEC_EMR_CMPFILTER_Pos                 12
#define AFEC_EMR_CMPFILTER_Msk                 ( 0x3u << AFEC_EMR_CMPFILTER_Pos ) /**< \brief (AFEC_EMR) Compare Event Filtering */
#define AFEC_EMR_CMPFILTER( value )    ( ( AFEC_EMR_CMPFILTER_Msk & ( ( value ) << AFEC_EMR_CMPFILTER_Pos ) ) )
#define AFEC_EMR_RES_Pos                       16
#define AFEC_EMR_RES_Msk                       ( 0x7u << AFEC_EMR_RES_Pos )      /**< \brief (AFEC_EMR) Resolution */
#define   AFEC_EMR_RES_NO_AVERAGE              ( 0x0u << 16 )                    /**< \brief (AFEC_EMR) 12-bit resolution, AFEC sample rate is maximum (no averaging). */
#define   AFEC_EMR_RES_OSR4                    ( 0x2u << 16 )                    /**< \brief (AFEC_EMR) 13-bit resolution, AFEC sample rate divided by 4 (averaging). */
#define   AFEC_EMR_RES_OSR16                   ( 0x3u << 16 )                    /**< \brief (AFEC_EMR) 14-bit resolution, AFEC sample rate divided by 16 (averaging). */
#define   AFEC_EMR_RES_OSR64                   ( 0x4u << 16 )                    /**< \brief (AFEC_EMR) 15-bit resolution, AFEC sample rate divided by 64 (averaging). */
#define   AFEC_EMR_RES_OSR256                  ( 0x5u << 16 )                    /**< \brief (AFEC_EMR) 16-bit resolution, AFEC sample rate divided by 256 (averaging). */
#define AFEC_EMR_AFEMODE_Pos                   20
#define AFEC_EMR_AFEMODE_Msk                   ( 0x3u << AFEC_EMR_AFEMODE_Pos )  /**< \brief (AFEC_EMR) AFE Running Mode */
#define   AFEC_EMR_AFEMODE_NORMAL              ( 0x0u << 20 )                    /**< \brief (AFEC_EMR) Normal mode of operation. */
#define   AFEC_EMR_AFEMODE_OFFSET_ERROR        ( 0x1u << 20 )                    /**< \brief (AFEC_EMR) Offset Error mode to measure the offset error. See Table 1-9 on page 35. */
#define   AFEC_EMR_AFEMODE_GAIN_ERROR_HIGH     ( 0x2u << 20 )                    /**< \brief (AFEC_EMR) Gain Error mode to measure the gain error. See Table 1-9 on page 35. */
#define   AFEC_EMR_AFEMODE_GAIN_ERROR_LOW      ( 0x3u << 20 )                    /**< \brief (AFEC_EMR)   */
#define AFEC_EMR_TAG                           ( 0x1u << 24 )                    /**< \brief (AFEC_EMR) TAG of the AFEC_LDCR */
#define AFEC_EMR_STM                           ( 0x1u << 25 )                    /**< \brief (AFEC_EMR) Single Trigger Mode */
#define AFEC_EMR_SIGNMODE_Pos                  28
#define AFEC_EMR_SIGNMODE_Msk                  ( 0x3u << AFEC_EMR_SIGNMODE_Pos ) /**< \brief (AFEC_EMR) Sign Mode */
#define   AFEC_EMR_SIGNMODE_SE_UNSG_DF_SIGN    ( 0x0u << 28 )                    /**< \brief (AFEC_EMR) Single-Ended Channels: Unsigned conversions.Differential Channels: Signed conversions. */
#define   AFEC_EMR_SIGNMODE_SE_SIGN_DF_UNSG    ( 0x1u << 28 )                    /**< \brief (AFEC_EMR) Single-Ended Channels: Signed conversions.Differential Channels: Unsigned conversions. */
#define   AFEC_EMR_SIGNMODE_ALL_UNSIGNED       ( 0x2u << 28 )                    /**< \brief (AFEC_EMR) All Channels: Unsigned conversions. */
#define   AFEC_EMR_SIGNMODE_ALL_SIGNED         ( 0x3u << 28 )                    /**< \brief (AFEC_EMR) All Channels: Signed conversions. */
/* -------- AFEC_SEQ1R : (AFEC Offset: 0x0C) AFEC Channel Sequence 1 Register -------- */
#define AFEC_SEQ1R_USCH0_Pos                   0
#define AFEC_SEQ1R_USCH0_Msk                   ( 0xfu << AFEC_SEQ1R_USCH0_Pos ) /**< \brief (AFEC_SEQ1R) User Sequence Number 0 */
#define AFEC_SEQ1R_USCH0( value )    ( ( AFEC_SEQ1R_USCH0_Msk & ( ( value ) << AFEC_SEQ1R_USCH0_Pos ) ) )
#define AFEC_SEQ1R_USCH1_Pos                   4
#define AFEC_SEQ1R_USCH1_Msk                   ( 0xfu << AFEC_SEQ1R_USCH1_Pos ) /**< \brief (AFEC_SEQ1R) User Sequence Number 1 */
#define AFEC_SEQ1R_USCH1( value )    ( ( AFEC_SEQ1R_USCH1_Msk & ( ( value ) << AFEC_SEQ1R_USCH1_Pos ) ) )
#define AFEC_SEQ1R_USCH2_Pos                   8
#define AFEC_SEQ1R_USCH2_Msk                   ( 0xfu << AFEC_SEQ1R_USCH2_Pos ) /**< \brief (AFEC_SEQ1R) User Sequence Number 2 */
#define AFEC_SEQ1R_USCH2( value )    ( ( AFEC_SEQ1R_USCH2_Msk & ( ( value ) << AFEC_SEQ1R_USCH2_Pos ) ) )
#define AFEC_SEQ1R_USCH3_Pos                   12
#define AFEC_SEQ1R_USCH3_Msk                   ( 0xfu << AFEC_SEQ1R_USCH3_Pos ) /**< \brief (AFEC_SEQ1R) User Sequence Number 3 */
#define AFEC_SEQ1R_USCH3( value )    ( ( AFEC_SEQ1R_USCH3_Msk & ( ( value ) << AFEC_SEQ1R_USCH3_Pos ) ) )
#define AFEC_SEQ1R_USCH4_Pos                   16
#define AFEC_SEQ1R_USCH4_Msk                   ( 0xfu << AFEC_SEQ1R_USCH4_Pos ) /**< \brief (AFEC_SEQ1R) User Sequence Number 4 */
#define AFEC_SEQ1R_USCH4( value )    ( ( AFEC_SEQ1R_USCH4_Msk & ( ( value ) << AFEC_SEQ1R_USCH4_Pos ) ) )
#define AFEC_SEQ1R_USCH5_Pos                   20
#define AFEC_SEQ1R_USCH5_Msk                   ( 0xfu << AFEC_SEQ1R_USCH5_Pos ) /**< \brief (AFEC_SEQ1R) User Sequence Number 5 */
#define AFEC_SEQ1R_USCH5( value )    ( ( AFEC_SEQ1R_USCH5_Msk & ( ( value ) << AFEC_SEQ1R_USCH5_Pos ) ) )
#define AFEC_SEQ1R_USCH6_Pos                   24
#define AFEC_SEQ1R_USCH6_Msk                   ( 0xfu << AFEC_SEQ1R_USCH6_Pos ) /**< \brief (AFEC_SEQ1R) User Sequence Number 6 */
#define AFEC_SEQ1R_USCH6( value )    ( ( AFEC_SEQ1R_USCH6_Msk & ( ( value ) << AFEC_SEQ1R_USCH6_Pos ) ) )
#define AFEC_SEQ1R_USCH7_Pos                   28
#define AFEC_SEQ1R_USCH7_Msk                   ( 0xfu << AFEC_SEQ1R_USCH7_Pos ) /**< \brief (AFEC_SEQ1R) User Sequence Number 7 */
#define AFEC_SEQ1R_USCH7( value )    ( ( AFEC_SEQ1R_USCH7_Msk & ( ( value ) << AFEC_SEQ1R_USCH7_Pos ) ) )
/* -------- AFEC_SEQ2R : (AFEC Offset: 0x10) AFEC Channel Sequence 2 Register -------- */
#define AFEC_SEQ2R_USCH8_Pos                   0
#define AFEC_SEQ2R_USCH8_Msk                   ( 0xfu << AFEC_SEQ2R_USCH8_Pos ) /**< \brief (AFEC_SEQ2R) User Sequence Number 8 */
#define AFEC_SEQ2R_USCH8( value )     ( ( AFEC_SEQ2R_USCH8_Msk & ( ( value ) << AFEC_SEQ2R_USCH8_Pos ) ) )
#define AFEC_SEQ2R_USCH9_Pos                   4
#define AFEC_SEQ2R_USCH9_Msk                   ( 0xfu << AFEC_SEQ2R_USCH9_Pos ) /**< \brief (AFEC_SEQ2R) User Sequence Number 9 */
#define AFEC_SEQ2R_USCH9( value )     ( ( AFEC_SEQ2R_USCH9_Msk & ( ( value ) << AFEC_SEQ2R_USCH9_Pos ) ) )
#define AFEC_SEQ2R_USCH10_Pos                  8
#define AFEC_SEQ2R_USCH10_Msk                  ( 0xfu << AFEC_SEQ2R_USCH10_Pos ) /**< \brief (AFEC_SEQ2R) User Sequence Number 10 */
#define AFEC_SEQ2R_USCH10( value )    ( ( AFEC_SEQ2R_USCH10_Msk & ( ( value ) << AFEC_SEQ2R_USCH10_Pos ) ) )
#define AFEC_SEQ2R_USCH11_Pos                  12
#define AFEC_SEQ2R_USCH11_Msk                  ( 0xfu << AFEC_SEQ2R_USCH11_Pos ) /**< \brief (AFEC_SEQ2R) User Sequence Number 11 */
#define AFEC_SEQ2R_USCH11( value )    ( ( AFEC_SEQ2R_USCH11_Msk & ( ( value ) << AFEC_SEQ2R_USCH11_Pos ) ) )
#define AFEC_SEQ2R_USCH12_Pos                  16
#define AFEC_SEQ2R_USCH12_Msk                  ( 0xfu << AFEC_SEQ2R_USCH12_Pos ) /**< \brief (AFEC_SEQ2R) User Sequence Number 12 */
#define AFEC_SEQ2R_USCH12( value )    ( ( AFEC_SEQ2R_USCH12_Msk & ( ( value ) << AFEC_SEQ2R_USCH12_Pos ) ) )
#define AFEC_SEQ2R_USCH13_Pos                  20
#define AFEC_SEQ2R_USCH13_Msk                  ( 0xfu << AFEC_SEQ2R_USCH13_Pos ) /**< \brief (AFEC_SEQ2R) User Sequence Number 13 */
#define AFEC_SEQ2R_USCH13( value )    ( ( AFEC_SEQ2R_USCH13_Msk & ( ( value ) << AFEC_SEQ2R_USCH13_Pos ) ) )
#define AFEC_SEQ2R_USCH14_Pos                  24
#define AFEC_SEQ2R_USCH14_Msk                  ( 0xfu << AFEC_SEQ2R_USCH14_Pos ) /**< \brief (AFEC_SEQ2R) User Sequence Number 14 */
#define AFEC_SEQ2R_USCH14( value )    ( ( AFEC_SEQ2R_USCH14_Msk & ( ( value ) << AFEC_SEQ2R_USCH14_Pos ) ) )
#define AFEC_SEQ2R_USCH15_Pos                  28
#define AFEC_SEQ2R_USCH15_Msk                  ( 0xfu << AFEC_SEQ2R_USCH15_Pos ) /**< \brief (AFEC_SEQ2R) User Sequence Number 15 */
#define AFEC_SEQ2R_USCH15( value )    ( ( AFEC_SEQ2R_USCH15_Msk & ( ( value ) << AFEC_SEQ2R_USCH15_Pos ) ) )
/* -------- AFEC_CHER : (AFEC Offset: 0x14) AFEC Channel Enable Register -------- */
#define AFEC_CHER_CH0                          ( 0x1u << 0 )  /**< \brief (AFEC_CHER) Channel 0 Enable */
#define AFEC_CHER_CH1                          ( 0x1u << 1 )  /**< \brief (AFEC_CHER) Channel 1 Enable */
#define AFEC_CHER_CH2                          ( 0x1u << 2 )  /**< \brief (AFEC_CHER) Channel 2 Enable */
#define AFEC_CHER_CH3                          ( 0x1u << 3 )  /**< \brief (AFEC_CHER) Channel 3 Enable */
#define AFEC_CHER_CH4                          ( 0x1u << 4 )  /**< \brief (AFEC_CHER) Channel 4 Enable */
#define AFEC_CHER_CH5                          ( 0x1u << 5 )  /**< \brief (AFEC_CHER) Channel 5 Enable */
#define AFEC_CHER_CH6                          ( 0x1u << 6 )  /**< \brief (AFEC_CHER) Channel 6 Enable */
#define AFEC_CHER_CH7                          ( 0x1u << 7 )  /**< \brief (AFEC_CHER) Channel 7 Enable */
