FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_afec.h
#define AFEC_CHER_CH8                          ( 0x1u << 8 )  /**< \brief (AFEC_CHER) Channel 8 Enable */
#define AFEC_CHER_CH9                          ( 0x1u << 9 )  /**< \brief (AFEC_CHER) Channel 9 Enable */
#define AFEC_CHER_CH10                         ( 0x1u << 10 ) /**< \brief (AFEC_CHER) Channel 10 Enable */
#define AFEC_CHER_CH11                         ( 0x1u << 11 ) /**< \brief (AFEC_CHER) Channel 11 Enable */
/* -------- AFEC_CHDR : (AFEC Offset: 0x18) AFEC Channel Disable Register -------- */
#define AFEC_CHDR_CH0                          ( 0x1u << 0 )  /**< \brief (AFEC_CHDR) Channel 0 Disable */
#define AFEC_CHDR_CH1                          ( 0x1u << 1 )  /**< \brief (AFEC_CHDR) Channel 1 Disable */
#define AFEC_CHDR_CH2                          ( 0x1u << 2 )  /**< \brief (AFEC_CHDR) Channel 2 Disable */
#define AFEC_CHDR_CH3                          ( 0x1u << 3 )  /**< \brief (AFEC_CHDR) Channel 3 Disable */
#define AFEC_CHDR_CH4                          ( 0x1u << 4 )  /**< \brief (AFEC_CHDR) Channel 4 Disable */
#define AFEC_CHDR_CH5                          ( 0x1u << 5 )  /**< \brief (AFEC_CHDR) Channel 5 Disable */
#define AFEC_CHDR_CH6                          ( 0x1u << 6 )  /**< \brief (AFEC_CHDR) Channel 6 Disable */
#define AFEC_CHDR_CH7                          ( 0x1u << 7 )  /**< \brief (AFEC_CHDR) Channel 7 Disable */
#define AFEC_CHDR_CH8                          ( 0x1u << 8 )  /**< \brief (AFEC_CHDR) Channel 8 Disable */
#define AFEC_CHDR_CH9                          ( 0x1u << 9 )  /**< \brief (AFEC_CHDR) Channel 9 Disable */
#define AFEC_CHDR_CH10                         ( 0x1u << 10 ) /**< \brief (AFEC_CHDR) Channel 10 Disable */
#define AFEC_CHDR_CH11                         ( 0x1u << 11 ) /**< \brief (AFEC_CHDR) Channel 11 Disable */
/* -------- AFEC_CHSR : (AFEC Offset: 0x1C) AFEC Channel Status Register -------- */
#define AFEC_CHSR_CH0                          ( 0x1u << 0 )  /**< \brief (AFEC_CHSR) Channel 0 Status */
#define AFEC_CHSR_CH1                          ( 0x1u << 1 )  /**< \brief (AFEC_CHSR) Channel 1 Status */
#define AFEC_CHSR_CH2                          ( 0x1u << 2 )  /**< \brief (AFEC_CHSR) Channel 2 Status */
#define AFEC_CHSR_CH3                          ( 0x1u << 3 )  /**< \brief (AFEC_CHSR) Channel 3 Status */
#define AFEC_CHSR_CH4                          ( 0x1u << 4 )  /**< \brief (AFEC_CHSR) Channel 4 Status */
#define AFEC_CHSR_CH5                          ( 0x1u << 5 )  /**< \brief (AFEC_CHSR) Channel 5 Status */
#define AFEC_CHSR_CH6                          ( 0x1u << 6 )  /**< \brief (AFEC_CHSR) Channel 6 Status */
#define AFEC_CHSR_CH7                          ( 0x1u << 7 )  /**< \brief (AFEC_CHSR) Channel 7 Status */
#define AFEC_CHSR_CH8                          ( 0x1u << 8 )  /**< \brief (AFEC_CHSR) Channel 8 Status */
#define AFEC_CHSR_CH9                          ( 0x1u << 9 )  /**< \brief (AFEC_CHSR) Channel 9 Status */
#define AFEC_CHSR_CH10                         ( 0x1u << 10 ) /**< \brief (AFEC_CHSR) Channel 10 Status */
#define AFEC_CHSR_CH11                         ( 0x1u << 11 ) /**< \brief (AFEC_CHSR) Channel 11 Status */
/* -------- AFEC_LCDR : (AFEC Offset: 0x20) AFEC Last Converted Data Register -------- */
#define AFEC_LCDR_LDATA_Pos                    0
#define AFEC_LCDR_LDATA_Msk                    ( 0xffffu << AFEC_LCDR_LDATA_Pos ) /**< \brief (AFEC_LCDR) Last Data Converted */
#define AFEC_LCDR_CHNB_Pos                     24
#define AFEC_LCDR_CHNB_Msk                     ( 0x1fu << AFEC_LCDR_CHNB_Pos )    /**< \brief (AFEC_LCDR) Channel Number */
/* -------- AFEC_IER : (AFEC Offset: 0x24) AFEC Interrupt Enable Register -------- */
#define AFEC_IER_EOC0                          ( 0x1u << 0 )                      /**< \brief (AFEC_IER) End of Conversion Interrupt Enable 0 */
#define AFEC_IER_EOC1                          ( 0x1u << 1 )                      /**< \brief (AFEC_IER) End of Conversion Interrupt Enable 1 */
#define AFEC_IER_EOC2                          ( 0x1u << 2 )                      /**< \brief (AFEC_IER) End of Conversion Interrupt Enable 2 */
#define AFEC_IER_EOC3                          ( 0x1u << 3 )                      /**< \brief (AFEC_IER) End of Conversion Interrupt Enable 3 */
#define AFEC_IER_EOC4                          ( 0x1u << 4 )                      /**< \brief (AFEC_IER) End of Conversion Interrupt Enable 4 */
#define AFEC_IER_EOC5                          ( 0x1u << 5 )                      /**< \brief (AFEC_IER) End of Conversion Interrupt Enable 5 */
#define AFEC_IER_EOC6                          ( 0x1u << 6 )                      /**< \brief (AFEC_IER) End of Conversion Interrupt Enable 6 */
#define AFEC_IER_EOC7                          ( 0x1u << 7 )                      /**< \brief (AFEC_IER) End of Conversion Interrupt Enable 7 */
#define AFEC_IER_EOC8                          ( 0x1u << 8 )                      /**< \brief (AFEC_IER) End of Conversion Interrupt Enable 8 */
#define AFEC_IER_EOC9                          ( 0x1u << 9 )                      /**< \brief (AFEC_IER) End of Conversion Interrupt Enable 9 */
#define AFEC_IER_EOC10                         ( 0x1u << 10 )                     /**< \brief (AFEC_IER) End of Conversion Interrupt Enable 10 */
#define AFEC_IER_EOC11                         ( 0x1u << 11 )                     /**< \brief (AFEC_IER) End of Conversion Interrupt Enable 11 */
#define AFEC_IER_DRDY                          ( 0x1u << 24 )                     /**< \brief (AFEC_IER) Data Ready Interrupt Enable */
#define AFEC_IER_GOVRE                         ( 0x1u << 25 )                     /**< \brief (AFEC_IER) General Overrun Error Interrupt Enable */
#define AFEC_IER_COMPE                         ( 0x1u << 26 )                     /**< \brief (AFEC_IER) Comparison Event Interrupt Enable */
#define AFEC_IER_TEMPCHG                       ( 0x1u << 30 )                     /**< \brief (AFEC_IER) Temperature Change Interrupt Enable */
/* -------- AFEC_IDR : (AFEC Offset: 0x28) AFEC Interrupt Disable Register -------- */
#define AFEC_IDR_EOC0                          ( 0x1u << 0 )                      /**< \brief (AFEC_IDR) End of Conversion Interrupt Disable 0 */
#define AFEC_IDR_EOC1                          ( 0x1u << 1 )                      /**< \brief (AFEC_IDR) End of Conversion Interrupt Disable 1 */
#define AFEC_IDR_EOC2                          ( 0x1u << 2 )                      /**< \brief (AFEC_IDR) End of Conversion Interrupt Disable 2 */
#define AFEC_IDR_EOC3                          ( 0x1u << 3 )                      /**< \brief (AFEC_IDR) End of Conversion Interrupt Disable 3 */
#define AFEC_IDR_EOC4                          ( 0x1u << 4 )                      /**< \brief (AFEC_IDR) End of Conversion Interrupt Disable 4 */
#define AFEC_IDR_EOC5                          ( 0x1u << 5 )                      /**< \brief (AFEC_IDR) End of Conversion Interrupt Disable 5 */
#define AFEC_IDR_EOC6                          ( 0x1u << 6 )                      /**< \brief (AFEC_IDR) End of Conversion Interrupt Disable 6 */
#define AFEC_IDR_EOC7                          ( 0x1u << 7 )                      /**< \brief (AFEC_IDR) End of Conversion Interrupt Disable 7 */
#define AFEC_IDR_EOC8                          ( 0x1u << 8 )                      /**< \brief (AFEC_IDR) End of Conversion Interrupt Disable 8 */
#define AFEC_IDR_EOC9                          ( 0x1u << 9 )                      /**< \brief (AFEC_IDR) End of Conversion Interrupt Disable 9 */
#define AFEC_IDR_EOC10                         ( 0x1u << 10 )                     /**< \brief (AFEC_IDR) End of Conversion Interrupt Disable 10 */
#define AFEC_IDR_EOC11                         ( 0x1u << 11 )                     /**< \brief (AFEC_IDR) End of Conversion Interrupt Disable 11 */
#define AFEC_IDR_DRDY                          ( 0x1u << 24 )                     /**< \brief (AFEC_IDR) Data Ready Interrupt Disable */
#define AFEC_IDR_GOVRE                         ( 0x1u << 25 )                     /**< \brief (AFEC_IDR) General Overrun Error Interrupt Disable */
#define AFEC_IDR_COMPE                         ( 0x1u << 26 )                     /**< \brief (AFEC_IDR) Comparison Event Interrupt Disable */
#define AFEC_IDR_TEMPCHG                       ( 0x1u << 30 )                     /**< \brief (AFEC_IDR) Temperature Change Interrupt Disable */
/* -------- AFEC_IMR : (AFEC Offset: 0x2C) AFEC Interrupt Mask Register -------- */
#define AFEC_IMR_EOC0                          ( 0x1u << 0 )                      /**< \brief (AFEC_IMR) End of Conversion Interrupt Mask 0 */
#define AFEC_IMR_EOC1                          ( 0x1u << 1 )                      /**< \brief (AFEC_IMR) End of Conversion Interrupt Mask 1 */
#define AFEC_IMR_EOC2                          ( 0x1u << 2 )                      /**< \brief (AFEC_IMR) End of Conversion Interrupt Mask 2 */
#define AFEC_IMR_EOC3                          ( 0x1u << 3 )                      /**< \brief (AFEC_IMR) End of Conversion Interrupt Mask 3 */
#define AFEC_IMR_EOC4                          ( 0x1u << 4 )                      /**< \brief (AFEC_IMR) End of Conversion Interrupt Mask 4 */
#define AFEC_IMR_EOC5                          ( 0x1u << 5 )                      /**< \brief (AFEC_IMR) End of Conversion Interrupt Mask 5 */
#define AFEC_IMR_EOC6                          ( 0x1u << 6 )                      /**< \brief (AFEC_IMR) End of Conversion Interrupt Mask 6 */
#define AFEC_IMR_EOC7                          ( 0x1u << 7 )                      /**< \brief (AFEC_IMR) End of Conversion Interrupt Mask 7 */
#define AFEC_IMR_EOC8                          ( 0x1u << 8 )                      /**< \brief (AFEC_IMR) End of Conversion Interrupt Mask 8 */
#define AFEC_IMR_EOC9                          ( 0x1u << 9 )                      /**< \brief (AFEC_IMR) End of Conversion Interrupt Mask 9 */
#define AFEC_IMR_EOC10                         ( 0x1u << 10 )                     /**< \brief (AFEC_IMR) End of Conversion Interrupt Mask 10 */
#define AFEC_IMR_EOC11                         ( 0x1u << 11 )                     /**< \brief (AFEC_IMR) End of Conversion Interrupt Mask 11 */
#define AFEC_IMR_DRDY                          ( 0x1u << 24 )                     /**< \brief (AFEC_IMR) Data Ready Interrupt Mask */
#define AFEC_IMR_GOVRE                         ( 0x1u << 25 )                     /**< \brief (AFEC_IMR) General Overrun Error Interrupt Mask */
#define AFEC_IMR_COMPE                         ( 0x1u << 26 )                     /**< \brief (AFEC_IMR) Comparison Event Interrupt Mask */
#define AFEC_IMR_TEMPCHG                       ( 0x1u << 30 )                     /**< \brief (AFEC_IMR) Temperature Change Interrupt Mask */
/* -------- AFEC_ISR : (AFEC Offset: 0x30) AFEC Interrupt Status Register -------- */
#define AFEC_ISR_EOC0                          ( 0x1u << 0 )                      /**< \brief (AFEC_ISR) End of Conversion 0 */
#define AFEC_ISR_EOC1                          ( 0x1u << 1 )                      /**< \brief (AFEC_ISR) End of Conversion 1 */
#define AFEC_ISR_EOC2                          ( 0x1u << 2 )                      /**< \brief (AFEC_ISR) End of Conversion 2 */
#define AFEC_ISR_EOC3                          ( 0x1u << 3 )                      /**< \brief (AFEC_ISR) End of Conversion 3 */
#define AFEC_ISR_EOC4                          ( 0x1u << 4 )                      /**< \brief (AFEC_ISR) End of Conversion 4 */
#define AFEC_ISR_EOC5                          ( 0x1u << 5 )                      /**< \brief (AFEC_ISR) End of Conversion 5 */
#define AFEC_ISR_EOC6                          ( 0x1u << 6 )                      /**< \brief (AFEC_ISR) End of Conversion 6 */
#define AFEC_ISR_EOC7                          ( 0x1u << 7 )                      /**< \brief (AFEC_ISR) End of Conversion 7 */
#define AFEC_ISR_EOC8                          ( 0x1u << 8 )                      /**< \brief (AFEC_ISR) End of Conversion 8 */
#define AFEC_ISR_EOC9                          ( 0x1u << 9 )                      /**< \brief (AFEC_ISR) End of Conversion 9 */
#define AFEC_ISR_EOC10                         ( 0x1u << 10 )                     /**< \brief (AFEC_ISR) End of Conversion 10 */
#define AFEC_ISR_EOC11                         ( 0x1u << 11 )                     /**< \brief (AFEC_ISR) End of Conversion 11 */
#define AFEC_ISR_DRDY                          ( 0x1u << 24 )                     /**< \brief (AFEC_ISR) Data Ready */
#define AFEC_ISR_GOVRE                         ( 0x1u << 25 )                     /**< \brief (AFEC_ISR) General Overrun Error */
#define AFEC_ISR_COMPE                         ( 0x1u << 26 )                     /**< \brief (AFEC_ISR) Comparison Error */
#define AFEC_ISR_TEMPCHG                       ( 0x1u << 30 )                     /**< \brief (AFEC_ISR) Temperature Change */
/* -------- AFEC_OVER : (AFEC Offset: 0x4C) AFEC Overrun Status Register -------- */
#define AFEC_OVER_OVRE0                        ( 0x1u << 0 )                      /**< \brief (AFEC_OVER) Overrun Error 0 */
#define AFEC_OVER_OVRE1                        ( 0x1u << 1 )                      /**< \brief (AFEC_OVER) Overrun Error 1 */
#define AFEC_OVER_OVRE2                        ( 0x1u << 2 )                      /**< \brief (AFEC_OVER) Overrun Error 2 */
#define AFEC_OVER_OVRE3                        ( 0x1u << 3 )                      /**< \brief (AFEC_OVER) Overrun Error 3 */
#define AFEC_OVER_OVRE4                        ( 0x1u << 4 )                      /**< \brief (AFEC_OVER) Overrun Error 4 */
#define AFEC_OVER_OVRE5                        ( 0x1u << 5 )                      /**< \brief (AFEC_OVER) Overrun Error 5 */
#define AFEC_OVER_OVRE6                        ( 0x1u << 6 )                      /**< \brief (AFEC_OVER) Overrun Error 6 */
#define AFEC_OVER_OVRE7                        ( 0x1u << 7 )                      /**< \brief (AFEC_OVER) Overrun Error 7 */
#define AFEC_OVER_OVRE8                        ( 0x1u << 8 )                      /**< \brief (AFEC_OVER) Overrun Error 8 */
#define AFEC_OVER_OVRE9                        ( 0x1u << 9 )                      /**< \brief (AFEC_OVER) Overrun Error 9 */
#define AFEC_OVER_OVRE10                       ( 0x1u << 10 )                     /**< \brief (AFEC_OVER) Overrun Error 10 */
#define AFEC_OVER_OVRE11                       ( 0x1u << 11 )                     /**< \brief (AFEC_OVER) Overrun Error 11 */
/* -------- AFEC_CWR : (AFEC Offset: 0x50) AFEC Compare Window Register -------- */
#define AFEC_CWR_LOWTHRES_Pos                  0
#define AFEC_CWR_LOWTHRES_Msk                  ( 0xffffu << AFEC_CWR_LOWTHRES_Pos ) /**< \brief (AFEC_CWR) Low Threshold */
#define AFEC_CWR_LOWTHRES( value )     ( ( AFEC_CWR_LOWTHRES_Msk & ( ( value ) << AFEC_CWR_LOWTHRES_Pos ) ) )
#define AFEC_CWR_HIGHTHRES_Pos                 16
#define AFEC_CWR_HIGHTHRES_Msk                 ( 0xffffu << AFEC_CWR_HIGHTHRES_Pos ) /**< \brief (AFEC_CWR) High Threshold */
#define AFEC_CWR_HIGHTHRES( value )    ( ( AFEC_CWR_HIGHTHRES_Msk & ( ( value ) << AFEC_CWR_HIGHTHRES_Pos ) ) )
/* -------- AFEC_CG1R : (AFEC Offset: 0x54) AFEC Channel Gain 1 Register -------- */
#define AFEC_CG1R_GAIN0_Pos                    0
#define AFEC_CG1R_GAIN0_Msk                    ( 0x3u << AFEC_CG1R_GAIN0_Pos ) /**< \brief (AFEC_CG1R) Gain for channel 0 */
#define AFEC_CG1R_GAIN0( value )     ( ( AFEC_CG1R_GAIN0_Msk & ( ( value ) << AFEC_CG1R_GAIN0_Pos ) ) )
#define AFEC_CG1R_GAIN1_Pos                    2
#define AFEC_CG1R_GAIN1_Msk                    ( 0x3u << AFEC_CG1R_GAIN1_Pos ) /**< \brief (AFEC_CG1R) Gain for channel 1 */
#define AFEC_CG1R_GAIN1( value )     ( ( AFEC_CG1R_GAIN1_Msk & ( ( value ) << AFEC_CG1R_GAIN1_Pos ) ) )
#define AFEC_CG1R_GAIN2_Pos                    4
#define AFEC_CG1R_GAIN2_Msk                    ( 0x3u << AFEC_CG1R_GAIN2_Pos ) /**< \brief (AFEC_CG1R) Gain for channel 2 */
#define AFEC_CG1R_GAIN2( value )     ( ( AFEC_CG1R_GAIN2_Msk & ( ( value ) << AFEC_CG1R_GAIN2_Pos ) ) )
#define AFEC_CG1R_GAIN3_Pos                    6
#define AFEC_CG1R_GAIN3_Msk                    ( 0x3u << AFEC_CG1R_GAIN3_Pos ) /**< \brief (AFEC_CG1R) Gain for channel 3 */
#define AFEC_CG1R_GAIN3( value )     ( ( AFEC_CG1R_GAIN3_Msk & ( ( value ) << AFEC_CG1R_GAIN3_Pos ) ) )
#define AFEC_CG1R_GAIN4_Pos                    8
#define AFEC_CG1R_GAIN4_Msk                    ( 0x3u << AFEC_CG1R_GAIN4_Pos ) /**< \brief (AFEC_CG1R) Gain for channel 4 */
#define AFEC_CG1R_GAIN4( value )     ( ( AFEC_CG1R_GAIN4_Msk & ( ( value ) << AFEC_CG1R_GAIN4_Pos ) ) )
#define AFEC_CG1R_GAIN5_Pos                    10
#define AFEC_CG1R_GAIN5_Msk                    ( 0x3u << AFEC_CG1R_GAIN5_Pos ) /**< \brief (AFEC_CG1R) Gain for channel 5 */
#define AFEC_CG1R_GAIN5( value )     ( ( AFEC_CG1R_GAIN5_Msk & ( ( value ) << AFEC_CG1R_GAIN5_Pos ) ) )
#define AFEC_CG1R_GAIN6_Pos                    12
#define AFEC_CG1R_GAIN6_Msk                    ( 0x3u << AFEC_CG1R_GAIN6_Pos ) /**< \brief (AFEC_CG1R) Gain for channel 6 */
#define AFEC_CG1R_GAIN6( value )     ( ( AFEC_CG1R_GAIN6_Msk & ( ( value ) << AFEC_CG1R_GAIN6_Pos ) ) )
#define AFEC_CG1R_GAIN7_Pos                    14
#define AFEC_CG1R_GAIN7_Msk                    ( 0x3u << AFEC_CG1R_GAIN7_Pos ) /**< \brief (AFEC_CG1R) Gain for channel 7 */
#define AFEC_CG1R_GAIN7( value )     ( ( AFEC_CG1R_GAIN7_Msk & ( ( value ) << AFEC_CG1R_GAIN7_Pos ) ) )
#define AFEC_CG1R_GAIN8_Pos                    16
#define AFEC_CG1R_GAIN8_Msk                    ( 0x3u << AFEC_CG1R_GAIN8_Pos ) /**< \brief (AFEC_CG1R) Gain for channel 8 */
#define AFEC_CG1R_GAIN8( value )     ( ( AFEC_CG1R_GAIN8_Msk & ( ( value ) << AFEC_CG1R_GAIN8_Pos ) ) )
#define AFEC_CG1R_GAIN9_Pos                    18
#define AFEC_CG1R_GAIN9_Msk                    ( 0x3u << AFEC_CG1R_GAIN9_Pos ) /**< \brief (AFEC_CG1R) Gain for channel 9 */
#define AFEC_CG1R_GAIN9( value )     ( ( AFEC_CG1R_GAIN9_Msk & ( ( value ) << AFEC_CG1R_GAIN9_Pos ) ) )
#define AFEC_CG1R_GAIN10_Pos                   20
#define AFEC_CG1R_GAIN10_Msk                   ( 0x3u << AFEC_CG1R_GAIN10_Pos ) /**< \brief (AFEC_CG1R) Gain for channel 10 */
#define AFEC_CG1R_GAIN10( value )    ( ( AFEC_CG1R_GAIN10_Msk & ( ( value ) << AFEC_CG1R_GAIN10_Pos ) ) )
#define AFEC_CG1R_GAIN11_Pos                   22
#define AFEC_CG1R_GAIN11_Msk                   ( 0x3u << AFEC_CG1R_GAIN11_Pos ) /**< \brief (AFEC_CG1R) Gain for channel 11 */
#define AFEC_CG1R_GAIN11( value )    ( ( AFEC_CG1R_GAIN11_Msk & ( ( value ) << AFEC_CG1R_GAIN11_Pos ) ) )
/* -------- AFEC_DIFFR : (AFEC Offset: 0x60) AFEC Channel Differential Register -------- */
#define AFEC_DIFFR_DIFF0                       ( 0x1u << 0 )  /**< \brief (AFEC_DIFFR) Differential inputs for channel 0 */
#define AFEC_DIFFR_DIFF1                       ( 0x1u << 1 )  /**< \brief (AFEC_DIFFR) Differential inputs for channel 1 */
#define AFEC_DIFFR_DIFF2                       ( 0x1u << 2 )  /**< \brief (AFEC_DIFFR) Differential inputs for channel 2 */
#define AFEC_DIFFR_DIFF3                       ( 0x1u << 3 )  /**< \brief (AFEC_DIFFR) Differential inputs for channel 3 */
#define AFEC_DIFFR_DIFF4                       ( 0x1u << 4 )  /**< \brief (AFEC_DIFFR) Differential inputs for channel 4 */
#define AFEC_DIFFR_DIFF5                       ( 0x1u << 5 )  /**< \brief (AFEC_DIFFR) Differential inputs for channel 5 */
#define AFEC_DIFFR_DIFF6                       ( 0x1u << 6 )  /**< \brief (AFEC_DIFFR) Differential inputs for channel 6 */
#define AFEC_DIFFR_DIFF7                       ( 0x1u << 7 )  /**< \brief (AFEC_DIFFR) Differential inputs for channel 7 */
#define AFEC_DIFFR_DIFF8                       ( 0x1u << 8 )  /**< \brief (AFEC_DIFFR) Differential inputs for channel 8 */
#define AFEC_DIFFR_DIFF9                       ( 0x1u << 9 )  /**< \brief (AFEC_DIFFR) Differential inputs for channel 9 */
#define AFEC_DIFFR_DIFF10                      ( 0x1u << 10 ) /**< \brief (AFEC_DIFFR) Differential inputs for channel 10 */
#define AFEC_DIFFR_DIFF11                      ( 0x1u << 11 ) /**< \brief (AFEC_DIFFR) Differential inputs for channel 11 */
/* -------- AFEC_CSELR : (AFEC Offset: 0x64) AFEC Channel Register Selection -------- */
#define AFEC_CSELR_CSEL_Pos                    0
#define AFEC_CSELR_CSEL_Msk                    ( 0x1fu << AFEC_CSELR_CSEL_Pos ) /**< \brief (AFEC_CSELR) Channel Selection */
#define AFEC_CSELR_CSEL( value )    ( ( AFEC_CSELR_CSEL_Msk & ( ( value ) << AFEC_CSELR_CSEL_Pos ) ) )
/* -------- AFEC_CDR : (AFEC Offset: 0x68) AFEC Channel Data Register -------- */
#define AFEC_CDR_DATA_Pos                      0
#define AFEC_CDR_DATA_Msk                      ( 0xfffu << AFEC_CDR_DATA_Pos ) /**< \brief (AFEC_CDR) Converted Data */
/* -------- AFEC_COCR : (AFEC Offset: 0x6C) AFEC Channel Offset Compensation Register -------- */
#define AFEC_COCR_AOFF_Pos                     0
#define AFEC_COCR_AOFF_Msk                     ( 0xfffu << AFEC_COCR_AOFF_Pos ) /**< \brief (AFEC_COCR) Analog Offset */
#define AFEC_COCR_AOFF( value )    ( ( AFEC_COCR_AOFF_Msk & ( ( value ) << AFEC_COCR_AOFF_Pos ) ) )
/* -------- AFEC_TEMPMR : (AFEC Offset: 0x70) AFEC Temperature Sensor Mode Register -------- */
#define AFEC_TEMPMR_RTCT                       ( 0x1u << 0 )                          /**< \brief (AFEC_TEMPMR) Temperature Sensor RTC Trigger mode */
#define AFEC_TEMPMR_TEMPCMPMOD_Pos             4
#define AFEC_TEMPMR_TEMPCMPMOD_Msk             ( 0x3u << AFEC_TEMPMR_TEMPCMPMOD_Pos ) /**< \brief (AFEC_TEMPMR) Temperature Comparison Mode */
#define   AFEC_TEMPMR_TEMPCMPMOD_LOW           ( 0x0u << 4 )                          /**< \brief (AFEC_TEMPMR) Generates an event when the converted data is lower than the low threshold of the window. */
#define   AFEC_TEMPMR_TEMPCMPMOD_HIGH          ( 0x1u << 4 )                          /**< \brief (AFEC_TEMPMR) Generates an event when the converted data is higher than the high threshold of the window. */
#define   AFEC_TEMPMR_TEMPCMPMOD_IN            ( 0x2u << 4 )                          /**< \brief (AFEC_TEMPMR) Generates an event when the converted data is in the comparison window. */
#define   AFEC_TEMPMR_TEMPCMPMOD_OUT           ( 0x3u << 4 )                          /**< \brief (AFEC_TEMPMR) Generates an event when the converted data is out of the comparison window. */
/* -------- AFEC_TEMPCWR : (AFEC Offset: 0x74) AFEC Temperature Compare Window Register -------- */
#define AFEC_TEMPCWR_TLOWTHRES_Pos             0
#define AFEC_TEMPCWR_TLOWTHRES_Msk             ( 0xffffu << AFEC_TEMPCWR_TLOWTHRES_Pos ) /**< \brief (AFEC_TEMPCWR) Temperature Low Threshold */
#define AFEC_TEMPCWR_TLOWTHRES( value )     ( ( AFEC_TEMPCWR_TLOWTHRES_Msk & ( ( value ) << AFEC_TEMPCWR_TLOWTHRES_Pos ) ) )
#define AFEC_TEMPCWR_THIGHTHRES_Pos            16
#define AFEC_TEMPCWR_THIGHTHRES_Msk            ( 0xffffu << AFEC_TEMPCWR_THIGHTHRES_Pos ) /**< \brief (AFEC_TEMPCWR) Temperature High Threshold */
#define AFEC_TEMPCWR_THIGHTHRES( value )    ( ( AFEC_TEMPCWR_THIGHTHRES_Msk & ( ( value ) << AFEC_TEMPCWR_THIGHTHRES_Pos ) ) )
/* -------- AFEC_ACR : (AFEC Offset: 0x94) AFEC Analog Control Register -------- */
#define AFEC_ACR_IBCTL_Pos                     8
#define AFEC_ACR_IBCTL_Msk                     ( 0x3u << AFEC_ACR_IBCTL_Pos ) /**< \brief (AFEC_ACR) AFEC Bias Current Control */
#define AFEC_ACR_IBCTL( value )    ( ( AFEC_ACR_IBCTL_Msk & ( ( value ) << AFEC_ACR_IBCTL_Pos ) ) )
/* -------- AFEC_SHMR : (AFEC Offset: 0xA0) AFEC Sample & Hold Mode Register -------- */
#define AFEC_SHMR_DUAL0                        ( 0x1u << 0 )  /**< \brief (AFEC_SHMR) Dual Sample & Hold for channel 0 */
#define AFEC_SHMR_DUAL1                        ( 0x1u << 1 )  /**< \brief (AFEC_SHMR) Dual Sample & Hold for channel 1 */
#define AFEC_SHMR_DUAL2                        ( 0x1u << 2 )  /**< \brief (AFEC_SHMR) Dual Sample & Hold for channel 2 */
