FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/component/component_afec.h
#define AFEC_SHMR_DUAL3                        ( 0x1u << 3 )  /**< \brief (AFEC_SHMR) Dual Sample & Hold for channel 3 */
#define AFEC_SHMR_DUAL4                        ( 0x1u << 4 )  /**< \brief (AFEC_SHMR) Dual Sample & Hold for channel 4 */
#define AFEC_SHMR_DUAL5                        ( 0x1u << 5 )  /**< \brief (AFEC_SHMR) Dual Sample & Hold for channel 5 */
#define AFEC_SHMR_DUAL6                        ( 0x1u << 6 )  /**< \brief (AFEC_SHMR) Dual Sample & Hold for channel 6 */
#define AFEC_SHMR_DUAL7                        ( 0x1u << 7 )  /**< \brief (AFEC_SHMR) Dual Sample & Hold for channel 7 */
#define AFEC_SHMR_DUAL8                        ( 0x1u << 8 )  /**< \brief (AFEC_SHMR) Dual Sample & Hold for channel 8 */
#define AFEC_SHMR_DUAL9                        ( 0x1u << 9 )  /**< \brief (AFEC_SHMR) Dual Sample & Hold for channel 9 */
#define AFEC_SHMR_DUAL10                       ( 0x1u << 10 ) /**< \brief (AFEC_SHMR) Dual Sample & Hold for channel 10 */
#define AFEC_SHMR_DUAL11                       ( 0x1u << 11 ) /**< \brief (AFEC_SHMR) Dual Sample & Hold for channel 11 */
/* -------- AFEC_COSR : (AFEC Offset: 0xD0) AFEC Correction Select Register -------- */
#define AFEC_COSR_CSEL_Pos                     0
#define AFEC_COSR_CSEL_Msk                     ( 0x1fu << AFEC_COSR_CSEL_Pos ) /**< \brief (AFEC_COSR) 2 Correction Select */
#define AFEC_COSR_CSEL( value )    ( ( AFEC_COSR_CSEL_Msk & ( ( value ) << AFEC_COSR_CSEL_Pos ) ) )
/* -------- AFEC_CVR : (AFEC Offset: 0xD4) AFEC Correction Values Register -------- */
#define AFEC_CVR_OFFSETCORR_Pos                0
#define AFEC_CVR_OFFSETCORR_Msk                ( 0xffffu << AFEC_CVR_OFFSETCORR_Pos ) /**< \brief (AFEC_CVR) Offset Correction */
#define AFEC_CVR_OFFSETCORR( value )    ( ( AFEC_CVR_OFFSETCORR_Msk & ( ( value ) << AFEC_CVR_OFFSETCORR_Pos ) ) )
#define AFEC_CVR_GAINCORR_Pos                  16
#define AFEC_CVR_GAINCORR_Msk                  ( 0xffffu << AFEC_CVR_GAINCORR_Pos ) /**< \brief (AFEC_CVR) Gain Correction */
#define AFEC_CVR_GAINCORR( value )      ( ( AFEC_CVR_GAINCORR_Msk & ( ( value ) << AFEC_CVR_GAINCORR_Pos ) ) )
/* -------- AFEC_CECR : (AFEC Offset: 0xD8) AFEC Channel Error Correction Register -------- */
#define AFEC_CECR_ECORR0                       ( 0x1u << 0 )                        /**< \brief (AFEC_CECR) Error Correction Enable for channel 0 */
#define AFEC_CECR_ECORR1                       ( 0x1u << 1 )                        /**< \brief (AFEC_CECR) Error Correction Enable for channel 1 */
#define AFEC_CECR_ECORR2                       ( 0x1u << 2 )                        /**< \brief (AFEC_CECR) Error Correction Enable for channel 2 */
#define AFEC_CECR_ECORR3                       ( 0x1u << 3 )                        /**< \brief (AFEC_CECR) Error Correction Enable for channel 3 */
#define AFEC_CECR_ECORR4                       ( 0x1u << 4 )                        /**< \brief (AFEC_CECR) Error Correction Enable for channel 4 */
#define AFEC_CECR_ECORR5                       ( 0x1u << 5 )                        /**< \brief (AFEC_CECR) Error Correction Enable for channel 5 */
#define AFEC_CECR_ECORR6                       ( 0x1u << 6 )                        /**< \brief (AFEC_CECR) Error Correction Enable for channel 6 */
#define AFEC_CECR_ECORR7                       ( 0x1u << 7 )                        /**< \brief (AFEC_CECR) Error Correction Enable for channel 7 */
#define AFEC_CECR_ECORR8                       ( 0x1u << 8 )                        /**< \brief (AFEC_CECR) Error Correction Enable for channel 8 */
#define AFEC_CECR_ECORR9                       ( 0x1u << 9 )                        /**< \brief (AFEC_CECR) Error Correction Enable for channel 9 */
#define AFEC_CECR_ECORR10                      ( 0x1u << 10 )                       /**< \brief (AFEC_CECR) Error Correction Enable for channel 10 */
#define AFEC_CECR_ECORR11                      ( 0x1u << 11 )                       /**< \brief (AFEC_CECR) Error Correction Enable for channel 11 */
/* -------- AFEC_WPMR : (AFEC Offset: 0xE4) AFEC Write Protection Mode Register -------- */
#define AFEC_WPMR_WPEN                         ( 0x1u << 0 )                        /**< \brief (AFEC_WPMR) Write Protection Enable */
#define AFEC_WPMR_WPKEY_Pos                    8
#define AFEC_WPMR_WPKEY_Msk                    ( 0xffffffu << AFEC_WPMR_WPKEY_Pos ) /**< \brief (AFEC_WPMR) Write Protect KEY */
#define   AFEC_WPMR_WPKEY_PASSWD               ( 0x414443u << 8 )                   /**< \brief (AFEC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. */
/* -------- AFEC_WPSR : (AFEC Offset: 0xE8) AFEC Write Protection Status Register -------- */
#define AFEC_WPSR_WPVS                         ( 0x1u << 0 )                        /**< \brief (AFEC_WPSR) Write Protect Violation Status */
#define AFEC_WPSR_WPVSRC_Pos                   8
#define AFEC_WPSR_WPVSRC_Msk                   ( 0xffffu << AFEC_WPSR_WPVSRC_Pos )  /**< \brief (AFEC_WPSR) Write Protect Violation Source */
/* -------- AFEC_VERSION : (AFEC Offset: 0xFC) AFEC Version Register -------- */
#define AFEC_VERSION_VERSION_Pos               0
#define AFEC_VERSION_VERSION_Msk               ( 0xfffu << AFEC_VERSION_VERSION_Pos ) /**< \brief (AFEC_VERSION) Version of the Hardware Module */
#define AFEC_VERSION_MFN_Pos                   16
#define AFEC_VERSION_MFN_Msk                   ( 0x7u << AFEC_VERSION_MFN_Pos )       /**< \brief (AFEC_VERSION) Metal Fix Number */

/*@}*/


#endif /* _SAM_AFEC_COMPONENT_ */
